# WSScript_GetPrmInt

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.

```pascal
FUNCTION WSScript_GetPrmInt(paramIndex : INTEGER): INTEGER;
```

```python
def vs.WSScript_GetPrmInt(paramIndex):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paramIndex|INTEGER|Zero based index of the parameter passed to the RunScript worksheet function.|

## Examples
```pascal
resultN := WSScript_GetPrmInt(1);
```
```python
import vs

# This function must be used inside a worksheet script called by 'RunScript'
# worksheet formula.
paramIndex = 1

resultN = vs.WSScript_GetPrmInt(paramIndex)
vs.Message('WSScript_GetPrmInt returned: ' + str(resultN))
```

## See Also
VS Functions:
WSScript_GetObject
| WSScript_GetPrmInt
| WSScript_GetPrmReal
| WSScript_GetPrmStr
| WSScript_SetResStr
| WSScript_SetResReal
| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016

## Category
* Worksheets